# Tarea Pandas: Filtrado Avanzado

In [21]:
import pandas as pd
import numpy as pd
pd.__version__

'2.3.3'

## Ejemplos de filtrado avanzado para DataFrames

In [11]:
import pandas as pd
import numpy as np

# Creación de un DataFrame de ejemplo para los filtros
data = {
    'Nombre': ['Ana', 'Luis', 'María', 'Pedro', 'Laura', 'Javier', 'Elena', 'Carlos', 'Sofía', 'Daniel'],
    'Edad': [25, 30, 22, 45, 30, 35, 28, 50, 22, 30],
    'Ciudad': ['Madrid', 'Barcelona', 'Madrid', 'Valencia', 'Sevilla', 'Barcelona', 'Madrid', 'Valencia', 'Sevilla', 'Barcelona'],
    'Ingreso': [45000, 60000, 32000, 75000, 45000, 55000, 48000, 80000, 32000, 60000],
    'Antiguedad': [3, 8, 1, 15, 3, 5, 2, 20, 1, 8],
    'Puesto': ['Analista Jr', 'Gerente', 'Asistente', 'Director', 'Analista Jr', 'Especialista', 'Analista Sr', 'Director', 'Asistente', 'Gerente']
}
df = pd.DataFrame(data)
print("DataFrame Original:")
df

DataFrame Original:

   Nombre  Edad     Ciudad  Ingreso  Antiguedad        Puesto
0     Ana    25     Madrid    45000           3   Analista Jr
1    Luis    30  Barcelona    60000           8       Gerente
2   María    22     Madrid    32000           1     Asistente
3   Pedro    45   Valencia    75000          15      Director
4   Laura    30    Sevilla    45000           3   Analista Jr
5  Javier    35  Barcelona    55000           5  Especialista
6   Elena    28     Madrid    48000           2   Analista Sr
7  Carlos    50   Valencia    80000          20      Director
8   Sofía    22    Sevilla    32000           1     Asistente
9  Daniel    30  Barcelona    60000           8       Gerente

In [14]:
#Filtro 1: Gerentes o alto ingreso
filtro_or = (df["Puesto"] == "Gerente") | (df["Ingreso"] > 70000)
filtro_or
df_filtro1 = df[filtro_or]
df_filtro1

   Nombre  Edad     Ciudad  Ingreso  Antiguedad    Puesto
1    Luis    30  Barcelona    60000           8   Gerente
3   Pedro    45   Valencia    75000          15  Director
7  Carlos    50   Valencia    80000          20  Director
9  Daniel    30  Barcelona    60000           8   Gerente

In [25]:
# Filtro 2: Ciudades especificas.
ciudades_seleccionadas = ['Madrid', 'Barcelona', 'Sevilla']
filtro_isin = df['Ciudad'].isin(ciudades_seleccionadas)

df_filtro2 = df[filtro_isin]
df_filtro2

   Nombre  Edad     Ciudad  Ingreso  Antiguedad        Puesto
0     Ana    25     Madrid    45000           3   Analista Jr
1    Luis    30  Barcelona    60000           8       Gerente
2   María    22     Madrid    32000           1     Asistente
4   Laura    30    Sevilla    45000           3   Analista Jr
5  Javier    35  Barcelona    55000           5  Especialista
6   Elena    28     Madrid    48000           2   Analista Sr
8   Sofía    22    Sevilla    32000           1     Asistente
9  Daniel    30  Barcelona    60000           8       Gerente

## 3. Filtrado por Subcadenas de Texto con .str.contains()

In [27]:
# Filtro 3: Puestos que contienen la subcadena 'Analista'
# 'case=False' ignora mayúsculas/minúsculas
filtro_str = df['Puesto'].str.contains('Analista', case=False)
df_filtro3 = df[filtro_str]
df_filtro3

  Nombre  Edad   Ciudad  Ingreso  Antiguedad       Puesto
0    Ana    25   Madrid    45000           3  Analista Jr
4  Laura    30  Sevilla    45000           3  Analista Jr
6  Elena    28   Madrid    48000           2  Analista Sr

## 4. Filtrado Basado en Estadísticas (Desviación Estándar)

In [29]:
media_antiguedad = df["Antiguedad"].mean()
desviacion_antiguedad = df["Antiguedad"].std()

umbral_antiguedad = media_antiguedad + desviacion_antiguedad
print(f"\nUmbral de Antiguedad: {umbral_antiguedad:.2f}")

filtro_outlier = df['Antiguedad'] > umbral_antiguedad

df_filtro4 = df[filtro_outlier]
print("\n--- Ejemplo 4: Antigüedad Atípica (> Media + 1*Std) ---")
df_filtro4

Umbral de Antiguedad: 12.98

--- Ejemplo 4: Antigüedad Atípica (> Media + 1*Std) ---

   Nombre  Edad    Ciudad  Ingreso  Antiguedad    Puesto
3   Pedro    45  Valencia    75000          15  Director
7  Carlos    50  Valencia    80000          20  Director

## 5. Filtrado con Negación Lógica usando

In [31]:
# Filtro 5: Negar la condición (NO es Analista)
# La condición a negar: df['Puesto'].str.contains('Analista', case=False)
filtro_negacion = ~df['Puesto'].str.contains('Analista', case=False) 

df_filtro5 = df[filtro_negacion]
print("\n--- Ejemplo 5: Negación Lógica (~ NO es Analista) ---")
df_filtro5

--- Ejemplo 5: Negación Lógica (~ NO es Analista) ---

   Nombre  Edad     Ciudad  Ingreso  Antiguedad        Puesto
1    Luis    30  Barcelona    60000           8       Gerente
2   María    22     Madrid    32000           1     Asistente
3   Pedro    45   Valencia    75000          15      Director
5  Javier    35  Barcelona    55000           5  Especialista
7  Carlos    50   Valencia    80000          20      Director
8   Sofía    22    Sevilla    32000           1     Asistente
9  Daniel    30  Barcelona    60000           8       Gerente